import math


def area(r):
    '''Принимает радиус круга r, возвращает площадь круга.

    Параметры:
        r (int/float): радиус круга

    Возвращаемое значение:
        area (float): площадь круга с радиусом r
    '''
    return math.pi * r * r


def perimeter(r):
    '''Принимает радиус круга r, возвращает длину окружности.

    Параметры:
        r (int/float): радиус круга

    Возвращаемое значение:
        perimeter (float): длина окружности с радиусом r
    '''
    return 2 * math.pi * r

